def Lat2Cyr_kpv(text):

    init_letter = { "e" : u"э", "jo" : u"ё", "ja" : u"я", "ju" : u"ю"}

    preletter = { "shtsh" : u"щ", "ʒ́" : "дз", "ǯ" : "дж", "w" : "в", "shch" : u"щ", "čja" : u"тшъя", "žja" : u"жъя", "žjo" : u"жъё", "\"e" : u"\"э", "-e" : u"-э", "ae" : u"аэ", "oe" : u"оэ", "'ae" : u"яэ", "jae" : u"яэ", "'ue" : u"юэ", "jue" : u"юэ", "'oe" : u"ёэ", "joe" : u"ёэ", "'ie" : u"иэ", "jie" : u"иэ", "bja" : u"бъя", "vja" : u"въя", "gja" : u"гъя", "dja" : u"дъя", "zhja" : u"жъя", "kja" : u"къя", "lja" : u"лъя", "mja" : u"мъя", "nja" : u"нъя", "pja" : u"пъя", "rja" : u"ръя", "sja" : u"съя", "tja" : u"тъя", "fja" : u"фъя", "xja" : u"хъя", "ćja" : u"чья", "zja" : u"зъя", "ńa" : "ня", "ńa" : "ня", "ńe" : "не", "ńi" : "ни", "ńo" : "нё", "ńu" : "ню", "ĺa" : "ля", "ĺe" : "ле", "ĺi" : "ли", "ĺo" : "лё", "ĺu" : "лю"
, "l'a" : "ля", "l'e" : "ле", "l'i" : "ли", "l'o" : "лё", "l'u" : "лю", "śa" : "ся", "śe" : "се", "śi" : "си", "śo" : "сё", "śu" : "сю", "źa" : "зя", "źe" : "зе", "źi" : "зи", "źo" : "зё", "źu" : "зю", "d'd'" : "дd'", "t't'" : "тt'"
, "t'a" : "тя", "t'e" : "те", "t'i" : "ти", "t'o" : "тё", "t'u" : "тю"
, "d'a" : "дя", "d'e" : "де", "d'i" : "ди", "d'o" : "дё", "d'u" : "дю"
, "śся" : "сся"
, "śсе" : "ссе"
, "śси" : "сси"
, "śсё" : "ссё"
, "śсю" : "ссю"

, "ńня" : "ння"
, "ńне" : "нне"
, "ńни" : "нни"
, "ńнё" : "ннё"
, "ńню" : "нню"

, "ńзя" : "нзя"
, "ńзе" : "нзе"
, "ńзи" : "нзи"
, "ńзё" : "нзё"
, "ńзю" : "нзю"

, "ʒ́ja" : "дзья"

, "ńтя" : "нтя"
, "ńте" : "нте"
, "ńти" : "нти"
, "ńтё" : "нтё"
, "ńтю" : "нтю"

, "źня" : "зня"
, "źне" : "зне"
, "źни" : "зни"
, "źнё" : "знё"
, "źню" : "зню"

, "l'ля" : "лля"
, "l'ле" : "лле"
, "l'ли" : "лли"
, "l'лё" : "ллё"
, "l'лю" : "ллю"

, "t'тя" : "ття"
, "t'те" : "тте"
, "t'ти" : "тти"
, "t'тё" : "ттё"
, "t'тю" : "ттю"

, "d'дя" : "ддя"
, "d'де" : "дде"
, "d'ди" : "дди"
, "d'дё" : "ддё"
, "d'дю" : "ддю"

    }

    letter = { "ć" : u"ч", "š" : u"ш", "c" : u"ц", "ž" : u"ж",  "č" : u"тш", "ø" : "ӧ", "ź" : "зь", "ń" : "нь", "ĺ" : "ль", "ś" : "сь" }

    pair_vowels = { "'e" : u"е", "de" : u"дэ", "ze" : u"зэ", "le" : u"лэ", "ne" : u"нэ", "se" : u"сэ", "te" : u"тэ", "ce" : u"цэ", "'i" : u"и", "di" : u"ді", "zi" : u"зі", "li" : u"лі", "ni" : u"ні", "ri" : u"ри", "si" : u"сі", "ti" : u"ті", "ci" : u"ці", "'a" : u"я", "'o" : u"ё" , "'u" : u"ю", "je" : u"е", "jo" : u"ё", "ju" : u"ю", "ja" : u"я",  "оjи" : u"ои", "уjи" : u"уи", "ӧjи" : u"ӧи", u"ȫ" : u"ӧӧ", u"ō" : u"оо", u"ū" : u"уу", u"дздз" : u"ддз" }

    other_letters = { "e" : u"е", "]" : u"э","'" : u"ь", "i" : u"и", "u" : u"у", "a" : u"а", "o" : u"о", "b" : u"б", "v" : u"в", "g" : u"г", "k" : u"к"
                     , "m" : u"м", "p" : u"п", "f" : u"ф", "d" : u"д", "z" : u"з", "l" : u"л", "n" : u"н", "r" : u"р", "s" : u"с", "t" : u"т", "j" : u"й"
                     , "h" : u"х", "c" : u"ц", "f" : u"ф", u"ö" : u"ӧ", "y" : u"ы", u"штш" : u"щ"
                     , u"сьпи" : u"спи", u"сьве" : u"све", u"зьве" : u"зве", u"сьме" : u"сме"}
    letter_list = [preletter, letter, pair_vowels, other_letters]

    for lup2 in letter_list + [init_letter]:
        for key in list(lup2.keys()):
            if key != key.title():
                lup2[key.title()] = lup2[key].title()
                lup2[key.upper()] = lup2[key].upper()
            
    cyr_line = []
    
    line = text.split(" ")
    cyr_token = []
    for token in line:
        for key,value in init_letter.items():
            if token.startswith(key):
                token = value + token[len(key):]
                break
        for l in letter_list:
            for key, value in l.items():
                token = token.replace(key,value)
        cyr_token.append(token)
    cyr_line.append(" ".join(cyr_token))
    return(''.join(cyr_line))
